# IsADirectContext3DHandleCategory Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DDocumentUtils..::..IsADirectContext3DHandleCategory Method
DirectContext3DDocumentUtils Class See Also
---
Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool IsADirectContext3DHandleCategory(
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Shared Function IsADirectContext3DHandleCategory ( _
	categoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsADirectContext3DHandleCategory(
	ElementId^ categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The category ID to check.
# ### Return Value
True, if the category is valid for DirectContext3D handle elements, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectContext3DDocumentUtils Class
Autodesk.Revit.DB.DirectContext3D Namespace